{
  "_name_or_path": "nvidia/mit-b0",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "unlabeled",
    "1": "LV",
    "2": "RV",
    "3": "RA",
    "4": "LA",
    "5": "VS",
    "6": "AS",
    "7": "MK",
    "8": "TK",
    "9": "ASD",
    "10": "VSD",
    "11": "AK"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "AK": 11,
    "AS": 6,
    "ASD": 9,
    "LA": 4,
    "LV": 1,
    "MK": 7,
    "RA": 3,
    "RV": 2,
    "TK": 8,
    "VS": 5,
    "VSD": 10,
    "unlabeled": 0
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.36.2"
}
